In [8]:
import numpy as np
import pandas as pd
import plotly.express as px
import plotly.io as pio
import seaborn as sns
pio.renderers.default='iframe'

In [2]:
df = pd.read_csv("./users.csv")

C:\Users\dti Digital\AppData\Local\Temp\ipykernel_4884\3757767376.py:1: DtypeWarning:

Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.

In [ ]:
df= df.head(200000)

## Countries

\# TO-DO: improve graphs' title and scale

In [3]:
countries = df['country'].value_counts().reset_index()
countries.columns = ['Country', 'Count']
countries['LogCount'] = np.log2(countries['Count'])
countries

              Country  Count   LogCount
0               India  66532  16.021761
1               China  22095  14.431432
2          Bangladesh  15412  13.911766
3              Russia  12823  13.646446
4               Egypt   8805  13.104107
..                ...    ...        ...
244  Marshall Islands      1   0.000000
245          Anguilla      1   0.000000
246  Saint Barthelemy      1   0.000000
247            Brunei      1   0.000000
248           Eritrea      1   0.000000

[249 rows x 3 columns]

In [4]:
fig = px.choropleth(
    countries,
    locations='Country',
    locationmode='country names',
    color='Count',
    hover_name='Country',
    color_continuous_scale=px.colors.sequential.Plasma
)

fig.update_layout(
    title_text='Choropleth Map of Countries by Occurrences',
    geo=dict(showframe=False, showcoastlines=False, projection_type='equirectangular')
)

fig.show()

In [5]:
fig = px.choropleth(
    countries,
    locations='Country',
    locationmode='country names',
    color='LogCount',
    hover_name='Country',
    color_continuous_scale=px.colors.sequential.Plasma
)

fig.update_layout(
    title_text='Choropleth Map of Countries by Logarithmic Occurrences',
    geo=dict(showframe=False, showcoastlines=False, projection_type='equirectangular')
)

fig.show()

## Universities

In [6]:
organizations = df['organization'].value_counts().reset_index()
organizations.columns = ['Organization', 'Count']
organizations.head(20)

                                         Organization  Count
0                                         IIT Roorkee   1605
1                                    IIT BHU Varanasi   1472
2                                      IIIT Hyderabad   1349
3                      Delhi Technological University   1297
4                                       IIT Kharagpur   1112
5                                        IIT Guwahati   1035
6                                          IIT Kanpur   1016
7                                           IIT Delhi    860
8                        BITS Pilani Hyderabad Campus    760
9                                           IIT Patna    723
10                                   Jiangly Fan Club    700
11                                     IIIT Allahabad    662
12                                         IIT Indore    598
13  Rajshahi University of Engineering and Technology    571
14                          FCIS Ain Shams University    565
15                                    ITMO University    550
16              BIRLA INSTITUTE OF TECHNOLOGY,  MESRA    547
17                                         IIIT Delhi    542
18                                   IIT(ISM) DHANBAD    537
19              Indian Institute of Technology Madras    537

## Rating

###